# Core utilities
brew "ripgrep"
brew "jq"
brew "fzf"
brew "fd"
brew "curl"
brew "wget"
brew "lsd"
brew "tldr"
brew "eza"
brew "bat"
brew "bat-extras"
brew "btop"
brew "lesspipe"
brew "neofetch"

# Shell
brew "zsh-vi-mode"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "starship"
brew "zoxide"
brew "direnv"
brew "forgit"

# Editors
brew "neovim"

# Terminal tools
brew "tmux"
brew "yazi"
brew "lazygit"

# Git
brew "git"
brew "gh"
brew "gnupg"
brew "pinentry-mac"

# Programming languages & runtimes
brew "go"
brew "rustup"
brew "nvm"
brew "pyenv"
brew "pnpm"
brew "uv"
brew "ghc"
brew "haskell-language-server"
brew "haskell-stack"

# Build & dev tools
brew "docker"
brew "docker-compose"
brew "kubernetes-cli"
brew "chezmoi"
brew "bats-core"

# Casks - Terminals
cask "ghostty"

# Casks - Browsers
cask "arc"

# Casks - Productivity
cask "obsidian"
cask "homerow"
cask "karabiner-elements"
cask "kindavim"
cask "maccy"
cask "meetingbar"
cask "doll"
cask "battery"
cask "logitech-options"

# Casks - Fonts
cask "font-comic-shanns-mono-nerd-font"
